emacs.d/emacs-init.org
* Start
** Installation
   For now I'm using GNU Emacs snapshot builds without the --HEAD option on the install,
   which would install the most cutting edge version (25.0.50 as on 02/Fev/2015).
   Better to keep it with the stable version for now (24.4)

   Two options are worth using on OSX:
   - GNU Emacs snapshot builds
     It can be installed by homebrew:

     $ brew install emacs --HEAD --use-git-head --cocoa --with-gnutls --with-librsvg --with-imagemagick

   - Emacs Mac Port (https://github.com/railwaycat/emacs-mac-port)
     It can be installed by homebrew:

     $ brew tap railwaycat/emacsmacport
     $ brew install emacs-mac

   Then to have launchd start emacs at login:
   $ ln -sfv /usr/local/opt/emacs/*.plist ~/Library/LaunchAgents

   source: http://emacs.stackexchange.com/questions/271/what-is-the-difference-between-aquamacs-and-other-mac-versions-of-emacs
   source: http://www.reddit.com/r/emacs/comments/195163/hey_mac_users/

** Source for Ideas
   A good place to start checking settings for Emacs is at: https://github.com/joedicastro/dotfiles/tree/master/emacs
   To understand better how this config file works whatch Venture into Emacs.

* Gui
** Turn off menus

#+begin_src emacs-lisp
  (when (window-system)
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1))
#+end_src

** Splash Screen
   Turns off the splash screen and goes straight into the scratch buffer. It
   turn off the initial scratch buffer message and sets Python as the initial
   mode.

#+BEGIN_SRC emacs-lisp
  (setq inhibit-splash-screen t
        initial-scratch-message nil
        initial-major-mode 'org-mode)
#+END_SRC

** Themes and Fonts

#+begin_src emacs-lisp
  (set-frame-font "Source Code Pro-12")
  (load-theme 'solarized-dark t)
  ;(load-theme 'zenburn)
  ;(load-theme 'naquadah t)
  ;(load-theme 'misterioso t)
#+end_src

** Fullscreen
   This works on OSX. Introduced on Emacs 24.4

#+BEGIN_SRC emacs-lisp
;  (toggle-frame-fullscreen)
#+END_SRC

* General Environment Settings
  Usually in configuration files *nil* and *t* for *false* and *true*, respectively.
  This apparently does not work in Cocoa Emacs. Replace nil with -1 and t with 1 and
  this should fix configuration options that seem to have stopped working.

#+begin_src emacs-lisp
  ;; Check if system is Mac or Linux for keeping compatibility
  (defun system-is-mac ()
    (interactive)
    (string-equal system-type "darwin"))

  (defun system-is-linux ()
    (interactive)
    (string-equal system-type "gnu/linux"))

  ;; set command key to be meta instead of option
  (if (system-is-mac)
     (setq ns-command-modifier 'meta))

  (setenv "LANG" "en_US")       ; set languase to en_US - solve ESS warning messages

  ;; Set default coding system to Unicode
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)

  (global-visual-line-mode t)   ;; breaks line text to other line
  (delete-selection-mode t)     ;; deletes text select when typed over
  (blink-cursor-mode t)         ;; blinking cursor

  (setq make-backup-files nil)          ;; disables backup files
  (setq auto-save-default t)            ;; disable auto-save
  (setq-default tab-width 2)            ;; sets tab to 2
  (setq-default indent-tabs-mode nil)   ;; use spaces (not tabs)
  (fset 'yes-or-no-p 'y-or-n-p)         ;; requires just y or n
  (setq x-select-enable-clipboard t)    ;; kill-ring accepts system clipboard

  (setq echo-keystrokes 0.1
      use-dialog-box nil
      visible-bell t)

  ;; Temporary files management
  (setq backup-directory-alist `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))

  (which-function-mode t)               ;; show the current function
  (global-prettify-symbols-mode t)       ;; use mathematical Unicode symbols instead of expressions
  (add-hook 'prog-mode-hook 'linum-mode) ;; line number only on programming modes
  (add-hook 'before-save-hook 'whitespace-cleanup) ;; remove trailing whitespace before saving file

  ;; set browser as the default browser on the system (for mac)
  (if (system-is-mac)
     (setq browse-url-browser-function 'browse-url-default-macosx-browser))
#+end_src

* General Packages Installed
** Diminish
   A diminished mode is a minor mode that has had its mode line
   display diminished, usually to nothing, although diminishing to a
   shorter word or a single letter is also supported.  This package
   implements diminished modes.

#+BEGIN_SRC emacs-lisp
(require 'diminish)
(eval-after-load "yasnippet" '(diminish 'yas-minor-mode))
(eval-after-load "eldoc" '(diminish 'eldoc-mode))
(eval-after-load "autopair" '(diminish 'autopair-mode))
(eval-after-load "abbrev" '(diminish 'abbrev-mode "Abv"))
(eval-after-load "company" '(diminish 'company-mode))
(eval-after-load "js2-highlight-vars" '(diminish 'js2-highlight-vars-mode))
(eval-after-load "projectile" '(diminish 'projectile-mode))
(eval-after-load "highlight-parentheses" '(diminish 'highlight-parentheses-mode))
(eval-after-load "anzu" '(diminish 'anzu-mode))
(eval-after-load "smartparens" '(diminish 'smartparens-mode))
;; (eval-after-load "magit" '(diminish 'magit-auto-revert-mode))
#+END_SRC

** Anzu
   anzu.el is an Emacs port of anzu.vim. anzu.el provides a minor mode
   which displays current match and total matches information in the
   mode-line in various search modes.

#+BEGIN_SRC emacs-lisp
(anzu-mode +1)
(global-anzu-mode +1)
(global-set-key (kbd "M-%") 'anzu-query-replace)
(global-set-key (kbd "C-M-%") 'anzu-query-replace-regexp)
#+END_SRC

** Smart-mode-line
   Smart Mode Line is a sexy mode-line for Emacs.
   It aims to be easy to read from small to large monitors by using colors, a prefix feature, and smart truncation.

#+begin_src emacs-lisp
 (sml/setup)
 (sml/apply-theme 'automatic)
 ;; abbreviate folder names
 (add-to-list 'sml/replacer-regexp-list '("^~/Projects" ":Proj:") t)
 (add-to-list 'sml/replacer-regexp-list '("^:Proj:/git" ":Git:") t)
 (add-to-list 'sml/replacer-regexp-list '("^:Git:/dotfiles" ":Dot:") t)
 (add-to-list 'sml/replacer-regexp-list '("^:Dot:/emacs.d" ":ED:") t)
 (add-to-list 'sml/replacer-regexp-list '("^~/Copy" ":CP:") t)
#+end_src

** Aggresssive-indent
Minor mode that keeps your code always indented. It reindents after every
command, making it more reliable than electric-indent-mode.

#+begin_src emacs-lisp
(global-aggressive-indent-mode 1)
#+end_src

** Smartparens

#+begin_src emacs-lisp
(require 'smartparens-config)
(smartparens-global-mode t)
(show-smartparens-global-mode t)
(setq sp-base-key-bindings 'paredit)
(setq sp-autoskip-closing-pair 'always)
(setq sp-hybrid-kill-entire-symbol nil)
(sp-use-paredit-bindings)

;; evil-smartparens makes smartparens and evil-mode play nicely together
;;(add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
#+end_src

** YAsnippet

#+begin_src emacs-lisp
  (yas-global-mode t)
#+end_src

*** Org-mode fix
    The way Org mode binds the <TAB> key (binding to [tab] instead of "\t") overrules YASnippet's access to this key.
    The following code fixed this problem:

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook
            (lambda ()
              (org-set-local 'yas/trigger-key [tab])
              (define-key yas/keymap [tab] 'yas/next-field-or-maybe-expand)))
#+END_SRC

** Company
   Company is a text completion framework for Emacs. The name stands for "complete
   anything". It uses pluggable back-ends and front-ends to retrieve and display
   completion candidates.  It comes with several back-ends such as Elisp, Clang,
   Semantic, Eclim, Ropemacs, Ispell, CMake, BBDB, Yasnippet, dabbrev, etags,
   gtags, files, keywords and a few others.

#+begin_src emacs-lisp
  (require 'company)
  (add-hook 'after-init-hook 'global-company-mode)
#+end_src

** Flycheck
   Flycheck is a modern on-the-fly syntax checking extension for GNU Emacs 24,
   intended as replacement for the older Flymake extension which is part of GNU
   Emacs.  It uses various syntax checking and linting tools to automatically check
   the contents of buffers while you type, and reports warnings and errors directly
   in the buffer, or in an optional error list.

#+begin_src emacs-lisp
  (add-hook 'after-init-hook #'global-flycheck-mode)
  ;(require 'flycheck-tip)
  ;(flycheck-tip-use-timer 'verbose)
  (add-hook 'prog-mode-hook 'flycheck-mode)
#+end_src

** Iedit
   Iedit - Edit multiple regions in the same way simultaneously.
   Here it is improved to take the word at point and only iedit occurrences in the local defun
   instead of the default behaviour that iedit occurrences in the whole buffer.
   iedit site: https://github.com/victorhge/iedit
   improved code site: http://www.masteringemacs.org/article/iedit-interactive-multi-occurrence-editing-in-your-buffer

#+BEGIN_SRC emacs-lisp
;(defun iedit-dwim (arg)
;  "Starts iedit but uses \\[narrow-to-defun] to limit its scope."
;  (interactive "P")
;  (if arg
;      (iedit-mode)
;    (save-excursion
;      (save-restriction
;        (widen)
;        ;; this function determines the scope of `iedit-start'.
;        (if iedit-mode
;            (iedit-done)
;          ;; `current-word' can of course be replaced by other
;          ;; functions.
;          (narrow-to-defun)
;          (iedit-start (current-word) (point-min) (point-max)))))))
;
;(global-set-key (kbd "C-;") 'iedit-dwim)

;; Fixing a key binding bug between iedit mode and yelp-mode (Python)
;(define-key global-map (kbd "C-c o") 'iedit-mode)
#+END_SRC

** Dash
   Dash provides documentation for several languages.

#+begin_src emacs-lisp
  (if (system-is-mac)
      (autoload 'dash-at-point "dash-at-point"
                "Search the word at point with Dash." t nil)
      (global-set-key "\C-cd" 'dash-at-point)
      (global-set-key "\C-ce" 'dash-at-point-with-docset))
#+end_src

