emacs.d/emacs-init.el

(when (window-system)
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1))

(setq inhibit-splash-screen t
      initial-scratch-message nil
      initial-major-mode 'python-mode)

(set-frame-font "Source Code Pro-13")
(load-theme 'solarized-dark t)
;(load-theme 'zenburn)
;(load-theme 'naquadah t)
;(load-theme 'misterioso t)

(toggle-frame-fullscreen)

;; Check if system is Mac or Linux for keeping compatibility
(defun system-is-mac ()
  (interactive)
  (string-equal system-type "darwin"))

(defun system-is-linux ()
  (interactive)
  (string-equal system-type "gnu/linux"))

;; set command key to be meta instead of option
(if (system-is-mac)
   (setq ns-command-modifier 'meta))

(setenv "LANG" "en_US")       ; set languase to en_US - solve ESS warning messages

;; Set default coding system to Unicode
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)

(global-visual-line-mode t)   ;; breaks line text to other line
(delete-selection-mode t)     ;; deletes text select when typed over
(blink-cursor-mode t)         ;; blinking cursor

(setq make-backup-files nil)          ;; disables backup files
(setq auto-save-default t)            ;; disable auto-save
(setq-default tab-width 2)            ;; sets tab to 2
(setq-default indent-tabs-mode nil)   ;; use spaces (not tabs)
(fset 'yes-or-no-p 'y-or-n-p)         ;; requires just y or n
(setq x-select-enable-clipboard t)    ;; kill-ring accepts system clipboard

(setq echo-keystrokes 0.1
    use-dialog-box nil
    visible-bell t)

;; Temporary files management
(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))

(which-function-mode t)               ;; show the current function
(global-prettify-symbols-mode t)       ;; use mathematical Unicode symbols instead of expressions
(add-hook 'prog-mode-hook 'linum-mode) ;; line number only on programming modes
(add-hook 'before-save-hook 'whitespace-cleanup) ;; remove trailing whitespace before saving file

;; set browser as the default browser on the system (for mac)
(setq browse-url-browser-function 'browse-url-default-macosx-browser)

(require 'diminish)
(eval-after-load "yasnippet" '(diminish 'yas-minor-mode))
(eval-after-load "eldoc" '(diminish 'eldoc-mode))
(eval-after-load "autopair" '(diminish 'autopair-mode))
(eval-after-load "abbrev" '(diminish 'abbrev-mode "Abv"))
(eval-after-load "company" '(diminish 'company-mode))
(eval-after-load "js2-highlight-vars" '(diminish 'js2-highlight-vars-mode))
(eval-after-load "projectile" '(diminish 'projectile-mode))
(eval-after-load "highlight-parentheses" '(diminish 'highlight-parentheses-mode))
(eval-after-load "anzu" '(diminish 'anzu-mode))
(eval-after-load "smartparens" '(diminish 'smartparens-mode))
(eval-after-load "magit" '(diminish 'magit-auto-revert-mode))

(anzu-mode +1)
(global-anzu-mode +1)
(global-set-key (kbd "M-%") 'anzu-query-replace)
(global-set-key (kbd "C-M-%") 'anzu-query-replace-regexp)

(sml/setup)
(sml/apply-theme 'automatic)
;; abbreviate folder names
(add-to-list 'sml/replacer-regexp-list '("^~/Projects" ":Proj:") t)
(add-to-list 'sml/replacer-regexp-list '("^:Proj:/git" ":Git:") t)
(add-to-list 'sml/replacer-regexp-list '("^:Git:/dotfiles" ":Dot:") t)
(add-to-list 'sml/replacer-regexp-list '("^:Dot:/emacs.d" ":ED:") t)
(add-to-list 'sml/replacer-regexp-list '("^~/Copy" ":CP:") t)

(global-aggressive-indent-mode 1)

(require 'smartparens-config)
(smartparens-global-mode t)
(show-smartparens-global-mode t)
(setq sp-base-key-bindings 'paredit)
(setq sp-autoskip-closing-pair 'always)
(setq sp-hybrid-kill-entire-symbol nil)
(sp-use-paredit-bindings)

;; evil-smartparens makes smartparens and evil-mode play nicely together
;;(add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)

(yas-global-mode t)

(add-hook 'org-mode-hook
          (lambda ()
            (org-set-local 'yas/trigger-key [tab])
            (define-key yas/keymap [tab] 'yas/next-field-or-maybe-expand)))

(require 'company)
(add-hook 'after-init-hook 'global-company-mode)

(add-hook 'after-init-hook #'global-flycheck-mode)
;(require 'flycheck-tip)
;(flycheck-tip-use-timer 'verbose)
(add-hook 'prog-mode-hook 'flycheck-mode)

;(defun iedit-dwim (arg)
;  "Starts iedit but uses \\[narrow-to-defun] to limit its scope."
;  (interactive "P")
;  (if arg
;      (iedit-mode)
;    (save-excursion
;      (save-restriction
;        (widen)
;        ;; this function determines the scope of `iedit-start'.
;        (if iedit-mode
;            (iedit-done)
;          ;; `current-word' can of course be replaced by other
;          ;; functions.
;          (narrow-to-defun)
;          (iedit-start (current-word) (point-min) (point-max)))))))
;
;(global-set-key (kbd "C-;") 'iedit-dwim)

;; Fixing a key binding bug between iedit mode and yelp-mode (Python)
;(define-key global-map (kbd "C-c o") 'iedit-mode)

(if (system-is-mac)
    (autoload 'dash-at-point "dash-at-point"
              "Search the word at point with Dash." t nil)
    (global-set-key "\C-cd" 'dash-at-point)
    (global-set-key "\C-ce" 'dash-at-point-with-docset))

(require 'dired+)
