emacs.d/emacs-init.org
** Dired

#+begin_src emacs-lisp
  (require 'dired+)
  (setq dired-recursive-deletes (quote top))
  (define-key dired-mode-map (kbd "f") 'dired-find-alternate-file)
  (define-key dired-mode-map (kbd "^") (lambda ()
                                         (interactive)
                                         (find-alternate-file "..")))

  ;;Stripe Dired buffers
  (require 'stripe-buffer)
  (add-hook 'org-mode-hook 'org-table-stripes-enable)
  (add-hook 'dired-mode-hook 'stripe-listify-buffer)
#+END_SRC

** Magit

#+begin_src emacs-lisp
  (set-default 'magit-stage-all-confirm nil)
  (add-hook 'magit-mode-hook 'magit-load-config-extensions)

  ;; full screen magit-status
  (defadvice magit-status (around magit-fullscreen activate)
    (window-configuration-to-register :magit-fullscreen)
    ad-do-it
    (delete-other-windows))

  (global-unset-key (kbd "C-x g"))
  (global-set-key (kbd "C-x g h") 'magit-log)
  (global-set-key (kbd "C-x g f") 'magit-file-log)
  (global-set-key (kbd "C-x g b") 'magit-blame-mode)
  (global-set-key (kbd "C-x g m") 'magit-branch-manager)
  (global-set-key (kbd "C-x g c") 'magit-branch)
  (global-set-key (kbd "C-x g s") 'magit-status)
  (global-set-key (kbd "C-x g r") 'magit-reflog)
  (global-set-key (kbd "C-x g t") 'magit-tag)
#+end_src

** Smooth scrolling
   Using the combination of smooth-scrolling(used in Spacemacs) and smooth-scrooll.
   check: https://github.com/syl20bnr/spacemacs/issues/1781

#+BEGIN_SRC emacs-lisp
;; smooth-scrolling config
(setq scroll-margin 5
scroll-conservatively 9999
scroll-step 1)

;; smooth-scroll config
(require 'smooth-scroll) ;; Smooth scroll
(smooth-scroll-mode 1) ;; Enable it
(setq smooth-scroll/vscroll-step-size 5) ;; Set the speed right
#+END_SRC
** Volatile Highlights
   This library provides minor mode `volatile-highlights-mode’, which
   brings visual feedback to some operations by highlighting portions
   relating to the operations.

   All of highlights made by this library will be removed when any new
   operation is executed.

#+BEGIN_SRC emacs-lisp
(require 'volatile-highlights)
(volatile-highlights-mode t)
#+END_SRC

** Conkeror
   Mode for editing conkeror javascript files.

   Currently, this minor-mode defines:

   1. A function for sending current javascript statement to be evaluated by
      conkeror. This function is eval-in-conkeror bound to C-c C-c.
   2. Syntax coloring.
   3. Indentation according to Conkeror Guidelines.
   4. Warning colors when anything in your code is not compliant with Conkeror
      Guidelines. If you find this one excessive, you can set
      conkeror-warn-about-guidelines to nil.

#+BEGIN_SRC emacs-lisp
  (add-hook 'js-mode-hook (lambda ()
                            (when (string-match "conkeror" (buffer-file-name))
                              (conkeror-minor-mode 1))))
#+END_SRC
* Org
** Loading additional org modules

#+begin_src emacs-lisp
  (require 'org-protocol)
  (require 'org-bullets)
  (require 'org-notmuch)
  (require 'org-drill)
  (require 'ox-latex)
  (require 'ox-beamer)
  (require 'ox-odt)
  (require 'ox-html)
  (require 'ox-deck)
  (require 'ox-publish)
  (require 'ox-bibtex)
  (require 'ox-koma-letter)
  (require 'ox-reveal)
#+end_src

** A few sane customisations

#+begin_src emacs-lisp
  (setq org-export-with-smart-quotes t)
  '(org-cycle-include-plain-lists t)
  '(org-alphabetical-lists t)
#+end_src

** Global keybindings
   The four Org commands org-store-link, org-capture, org-agenda, and org-iswitchb
   should be accessible through global keys (i.e., anywhere in Emacs, not just in Org buffers).

#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-cl" 'org-store-link)
  (global-set-key "\C-cc" 'org-capture)
  (global-set-key "\C-ca" 'org-agenda)
  (global-set-key "\C-cb" 'org-iswitchb)
#+END_SRC

** Org-bullets
   It puts a nice symbol instead of the usual asterisk on org-lists

#+BEGIN_SRC emacs-lisp
(setq org-hide-leading-stars t)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC

** Code blocks
   Babel is Org-mode’s ability to execute source code within Org-mode documents.

#+begin_src emacs-lisp
;; languages supported
(org-babel-do-load-languages
 (quote org-babel-load-languages)
 (quote (
         (calc . t)
         (clojure . t)
         (ditaa . t)
         (dot . t)
         (emacs-lisp . t)
         (gnuplot . t)
         (latex . t)
         (ledger . t)
         (octave . t)
         (org . t)
         (makefile . t)
         (plantuml . t)
         (python . t)
         (R . t)
         (ruby . t)
         (sh . t)
         (sqlite . t)
         (sql . nil))))
;(setq org-babel-python-command "python2")
#+end_src

** Code block fontification
The following displays the contents of code blocks in Org-mode files using
the major-mode of the code. It also changes the behavior of TAB to as if it
were used in the appropriate major mode. This means that reading and editing
code form inside of your Org-mode files is much more like reading and editing
of code using its major mode.

#+BEGIN_SRC emacs-lisp
(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
#+END_SRC

   Don’t ask for confirmation on every C-c C-c code-block compile.

#+BEGIN_SRC emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+END_SRC

** Babel Settings
Configure org-mode so that when you edit source code in an indirect buffer
(with C-c ‘), the buffer is opened in the current window. That way, your
window organization isn’t broken when switching.

#+BEGIN_SRC emacs-lisp
  (setq org-src-window-setup 'current-window)
#+END_SRC

** Archive Settings
   Where archived projects and tasks go.

#+BEGIN_SRC emacs-lisp
(setq org-archive-location "~/prj/org/archive.org::From %s")
#+END_SRC

** Mobile Settings
   Sync orgmode files with Copy/Dropbox and iPhone. #+src-name: orgmode-mobile

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Copy/Org")
(setq org-mobile-directory "~/Copy/MobileOrg")
;; Set to the files (or directory of files) you want sync'd
(setq org-agenda-files (quote ("~/Copy/Org")))
;; Set to the name of the file where new notes will be stored
(setq org-mobile-inbox-for-pull "~/Copy/Org/from-mobile.org")
#+END_SRC

** Org-latex-preview
   There are two methods used to preview Latex fragments on org files:
   dvipng and imagemagick. Dvipng conflicts with minted, which is used
   to highlight code blocks when exported, so imagemagick is used here.

   To show latex fragments: C-c C-x C-l and to get rid of it: C-c C-c

#+BEGIN_SRC emacs-lisp
  (setq org-latex-create-formula-image-program 'imagemagick)
#+END_SRC

** Exporters
*** XeLaTeX and pdfLaTeX Export Settings
    In order to use Minted for highlight code blocks, Pygments has to be installed:
    $ pip install Pygments

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)

  ;; This defines the variables minted uses for beautiful code-blocks.
  ;; Without this, the code-blocks will just look like inline text.
  (setq org-latex-minted-options
        '(("frame" "lines")
          ("framesep" "2mm")
          ("baselinestretch" "1.2")
          ("bgcolor" "mintedbg")
          ("mathescape" "true")
          ("linenos" "")
          ("fontsize" "\\footnotesize")))

  ;; LaTeX compilation command. For orgmode docs we just always use xelatex for convenience.
  ;; You can change it to pdflatex if you like, just remember to make the adjustments to the packages-alist below.
  (setq org-latex-pdf-process
        '("latexmk -pdflatex='xelatex -synctex=1 --shell-escape' -pdf %f"))

  ;; Sets the structure of the document to be Latex Koma-article by default
  (unless (boundp 'org-latex-classes)
        (setq org-latex-classes nil))
  (add-to-list 'org-latex-classes
               '("koma-article"
                 "\\documentclass{scrartcl}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  ;; To use the stardard Latex article design the class has to be included in the org file as:
  ;; #+LaTeX_CLASS: article
  ;; source: http://orgmode.org/worg/org-tutorials/org-latex-export.html
  (add-to-list 'org-latex-classes
               '("article"
                 "\\documentclass{article}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

 ;; As above, but to use Memoir design, set memarticle in the org file
  (add-to-list 'org-latex-classes
               '("memarticle"
                 "\\documentclass{memoir}"
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                  ("\\paragraph{%s}" . "\\paragraph*{%s}")
                  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC

* Evil

#+begin_src emacs-lisp
(require 'evil)
(evil-mode 1)

;; Change cursor color depending on mode
(setq evil-emacs-state-cursor '("red" box))
(setq evil-normal-state-cursor '("green" box))
(setq evil-visual-state-cursor '("orange" box))
(setq evil-insert-state-cursor '("red" bar))
(setq evil-replace-state-cursor '("red" bar))
(setq evil-operator-state-cursor '("red" hollow))
#+end_src

* Helm
   All the Helm configuration present here are originated from:
   http://tuhdo.github.io/index.html

   Helm is incremental completion and selection narrowing framework for
   Emacs. It will help steer you in the right direction when you're looking for
   stuff in Emacs (like buffers, files, etc).

   Helm is a fork of anything.el originally written by Tamas Patrovic and can be
   considered to be its successor. Helm sets out to clean up the legacy code in
   anything.el and provide a cleaner, leaner and more modular tool, that's not
   tied in the trap of backward compatibility.

