emacs.d/emacs-init.el
(setq dired-recursive-deletes (quote top))
(define-key dired-mode-map (kbd "f") 'dired-find-alternate-file)
(define-key dired-mode-map (kbd "^") (lambda ()
                                       (interactive)
                                       (find-alternate-file "..")))

;;Stripe Dired buffers
(require 'stripe-buffer)
(add-hook 'org-mode-hook 'org-table-stripes-enable)
(add-hook 'dired-mode-hook 'stripe-listify-buffer)

(set-default 'magit-stage-all-confirm nil)
(add-hook 'magit-mode-hook 'magit-load-config-extensions)

;; full screen magit-status
(defadvice magit-status (around magit-fullscreen activate)
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it
  (delete-other-windows))

(global-unset-key (kbd "C-x g"))
(global-set-key (kbd "C-x g h") 'magit-log)
(global-set-key (kbd "C-x g f") 'magit-file-log)
(global-set-key (kbd "C-x g b") 'magit-blame-mode)
(global-set-key (kbd "C-x g m") 'magit-branch-manager)
(global-set-key (kbd "C-x g c") 'magit-branch)
(global-set-key (kbd "C-x g s") 'magit-status)
(global-set-key (kbd "C-x g r") 'magit-reflog)
(global-set-key (kbd "C-x g t") 'magit-tag)

(require 'volatile-highlights)
(volatile-highlights-mode t)

(add-hook 'js-mode-hook (lambda ()
                          (when (string-match "conkeror" (buffer-file-name))
                            (conkeror-minor-mode 1))))

(require 'org-protocol)
(require 'org-bullets)
(require 'org-notmuch)
(require 'ox-latex)
(require 'ox-beamer)
(require 'ox-odt)
(require 'ox-html)
(require 'ox-deck)
(require 'ox-publish)
(require 'ox-bibtex)
(require 'ox-koma-letter)
(require 'ox-reveal)

(setq org-export-with-smart-quotes t)
'(org-cycle-include-plain-lists t)
'(org-alphabetical-lists t)

(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)

(setq org-hide-leading-stars t)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

;; languages supported
(org-babel-do-load-languages
 (quote org-babel-load-languages)
 (quote (
         (calc . t)
         (clojure . t)
         (ditaa . t)
         (dot . t)
         (emacs-lisp . t)
         (gnuplot . t)
         (latex . t)
         (ledger . t)
         (octave . t)
         (org . t)
         (makefile . t)
         (plantuml . t)
         (python . t)
         (R . t)
         (ruby . t)
         (sh . t)
         (sqlite . t)
         (sql . nil))))
;(setq org-babel-python-command "python2")

(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)

(setq org-confirm-babel-evaluate nil)

(setq org-src-window-setup 'current-window)

(setq org-archive-location "~/Copy/Org/archive.org::From %s")

(setq org-directory "~/Copy/Org")
(setq org-mobile-directory "~/Copy/MobileOrg")
;; Set to the files (or directory of files) you want sync'd
(setq org-agenda-files (quote ("~/Copy/Org")))
;; Set to the name of the file where new notes will be stored
(setq org-mobile-inbox-for-pull "~/Copy/Org/from-mobile.org")

(setq org-latex-create-formula-image-program 'imagemagick)

(add-to-list 'org-latex-packages-alist '("" "minted"))
 (setq org-latex-listings 'minted)

 ;; This defines the variables minted uses for beautiful code-blocks.
 ;; Without this, the code-blocks will just look like inline text.
 (setq org-latex-minted-options
       '(("frame" "lines")
         ("framesep" "2mm")
         ("baselinestretch" "1.2")
         ("bgcolor" "mintedbg")
         ("mathescape" "true")
         ("linenos" "")
         ("fontsize" "\\footnotesize")))

 ;; LaTeX compilation command. For orgmode docs we just always use xelatex for convenience.
 ;; You can change it to pdflatex if you like, just remember to make the adjustments to the packages-alist below.
 (setq org-latex-pdf-process
       '("latexmk -pdflatex='xelatex -synctex=1 --shell-escape' -pdf %f"))

 ;; Sets the structure of the document to be Latex Koma-article by default
 (unless (boundp 'org-latex-classes)
       (setq org-latex-classes nil))
 (add-to-list 'org-latex-classes
              '("koma-article"
                "\\documentclass{scrartcl}"
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

 ;; To use the stardard Latex article design the class has to be included in the org file as:
 ;; #+LaTeX_CLASS: article
 ;; source: http://orgmode.org/worg/org-tutorials/org-latex-export.html
 (add-to-list 'org-latex-classes
              '("article"
                "\\documentclass{article}"
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

;; As above, but to use Memoir design, set memarticle in the org file
 (add-to-list 'org-latex-classes
              '("memarticle"
                "\\documentclass{memoir}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

(require 'helm)
