emacs.d/emacs-init.org
** Helm Configuration

#+begin_src emacs-lisp
  (require 'helm)
  (require 'helm-config)

  (helm-autoresize-mode t)
  (global-set-key (kbd "M-x") 'helm-M-x)
  (setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (global-set-key (kbd "C-x b") 'helm-mini)
  (setq helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match    t)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)

  ;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
  ;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
  ;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
  (global-set-key (kbd "C-c h") 'helm-command-prefix)
  (global-unset-key (kbd "C-x c"))

  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
  (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB works in terminal
  (define-key helm-map (kbd "C-z") 'helm-select-action) ; list actions using C-z

  (when (executable-find "curl")
    (setq helm-google-suggest-use-curl-p t))

  (setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
        helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
        helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
        helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
        helm-ff-file-name-history-use-recentf t)

  (helm-mode 1)

  ;; Semantic-mode provides language-aware editing commands based on 'source code parsers'.
  ;; To activate it through helm-semantic-or-imenu press C-c-h-i
  (semantic-mode 1)
  (setq helm-semantic-fuzzy-match t
        helm-imenu-fuzzy-match    t)

  ;; Helm-company - Helm interface for company-mode
  (eval-after-load 'company
    '(progn
       (define-key company-mode-map (kbd "C-:") 'helm-company)
       (define-key company-active-map (kbd "C-:") 'helm-company)))
#+end_src

** Projectile
Projectile is a project interaction library for Emacs. Its goal is to provide a
nice set of features operating on a project level without introducing external
dependencies(when feasible).  For instance - finding project files has a
portable implementation written in pure Emacs Lisp without the use of GNU find
(but for performance sake an indexing mechanism backed by external commands
exists as well).

#+begin_src emacs-lisp
(projectile-global-mode)
(setq projectile-completion-system 'helm)
(helm-projectile-on)
(setq projectile-switch-project-action 'helm-projectile)
(setq projectile-enable-caching t)
#+end_src
* Latex
** In-text Smart Quotes (XeLaTeX only)
   Redefine TeX-open-quote and TeX-close-quote to be smart quotes by
   default. Below, in the local org-mode settings, we’ll also map the relevant
   function to a key we can use in org-mode, too. If you don’t use XeLaTeX for
   processing all your .tex files, you should disable this option.

#+BEGIN_SRC emacs-lisp
  (setq TeX-open-quote "“")
  (setq TeX-close-quote "”")
#+END_SRC

** SyncTeX, PDF mode, Skim
   Set up AUCTeX to work with the Skim PDF viewer.

#+BEGIN_SRC emacs-lisp
  ;; Synctex with Skim
  (add-hook 'TeX-mode-hook
  (lambda ()
  (add-to-list 'TeX-output-view-style
  '("^pdf$" "."
   "/Applications/Skim.app/Contents/SharedSupport/displayline %n %o %b"))))

  (setq TeX-view-program-selection '((output-pdf "PDF Viewer")))
  (setq TeX-view-program-list
       '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b")))

  ;; Make emacs aware of multi-file projects
  ;; (setq-default TeX-master nil)

  ;; Auto-raise Emacs on activation (from Skim, usually)
  (defun raise-emacs-on-aqua()
  (shell-command "osascript -e 'tell application \"Emacs\" to activate' &"))
  (add-hook 'server-switch-hook 'raise-emacs-on-aqua)
#+END_SRC

** Auctex
   Setting Skim as default pdf viewer and latexmk as latex engine.
   site: http://www.stefanom.org/setting-up-a-nice-auctex-environment-on-mac-os-x/

#+BEGIN_SRC emacs-lisp
  ;; AucTeX
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
  (add-hook 'LaTeX-mode-hook 'visual-line-mode)
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (setq reftex-plug-into-AUCTeX t)
  (setq TeX-PDF-mode t)

  ;; Use Skim as viewer, enable source <-> PDF sync
  ;; make latexmk available via C-c C-c
  ;; Note: SyncTeX is setup via ~/.latexmkrc (see below)
;  (add-hook 'LaTeX-mode-hook (lambda ()
;  (push
;  '("latexmk" "latexmk -pdf %s" TeX-run-TeX nil t
;  :help "Run latexmk on file")
;  TeX-command-list)))
;  (add-hook 'TeX-mode-hook '(lambda () (setq TeX-command-default "latexmk")))

  ;; use Skim as default pdf viewer
  ;; Skim's displayline is used for forward search (from .tex to .pdf)
  ;; option -b highlights the current line; option -g opens Skim in the background
;  (setq TeX-view-program-selection '((output-pdf "PDF Viewer")))
;  (setq TeX-view-program-list
;  '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b")))
#+END_SRC

** Local Pandoc Support
   A pandoc menu for markdown and tex files. #+src-name: pandoc_mode

#+BEGIN_SRC emacs-lisp
  (load "pandoc-mode")
  (add-hook 'markdown-mode-hook 'pandoc-mode)
  (add-hook 'TeX-mode-hook 'pandoc-mode)
  (add-hook 'pandoc-mode-hook 'pandoc-load-default-settings)
#+END_SRC
* Email
  E-mail is set using the following applications:
  - to retrieve: isync(mbsync)
  - to send: msmtp
  - to index and search: notmuch
  - to read (frontend): notmuch-mode on Emacs

  Details about configurations can be find at:
  http://notmuchmail.org/initial_tagging/
  http://notmuchmail.org/emacstips/
  http://chrisdone.com/posts/emacs-mail
  http://foivos.zakkak.net/tutorials/using_emacs_and_notmuch_mail_client.html
  https://www.bostonenginerd.com/posts/notmuch-of-a-mail-setup-part-1-mbsync-msmtp-and-systemd/
  http://dbp.io/essays/2013-06-29-hackers-replacement-for-gmail.html
  http://www.ict4g.net/adolfo/notes/2014/12/27/EmacsIMAP.html
  https://wiki.archlinux.org/index.php/Msmtp
  http://pbrisbin.com/posts/mutt_gmail_offlineimap/
  http://baron.vc/using-gmailimap-backups-for-super-fast-email/
  http://bloerg.net/2013/10/09/syncing-mails-with-mbsync-instead-of-offlineimap.html
  https://chrisstreeter.com/archive/2009/04/gmail-imap-backup-with-mbsync-on-ubuntu.html
  https://blog.rectalogic.com/2007/11/automated-gmail-backup-via-imap.html
  http://www.monperrus.net/martin/backup-imap
  http://emacs-berlin.org/20140327.html
  http://lwn.net/Articles/586992/
  http://stew.vireo.org/dotemacs/#sec-9

#+BEGIN_SRC emacs-lisp
  (require 'notmuch)     ; loads notmuch package
  (setq message-kill-buffer-on-exit t) ; kill buffer after sending mail)
  (setq mail-specify-envelope-from t) ; Settings to work with msmtp
                                          ;  (setq message-sendmail-envelope-from header)
                                          ;  (setq mail-envelope-from header)
  (setq notmuch-fcc-dirs "sent-mail") ; stores sent mail to the specified directory
  (setq message-directory "drafts") ; stores postponed messages to the specified directory

  ;; Completion selection with helm
  (setq notmuch-address-selection-function
        (lambda (prompt collection initial-input)
          (completing-read prompt (cons initial-input collection) nil t nil 'notmuch-address-history)))

  ;; Customized searches
  (setq notmuch-saved-searches '((:name "inbox"
                                        :query "tag:inbox and not tag:delete"
                                        :count-query "tag:inbox and tag:unread"
                                        :sort-order 'oldest-first)
                                 (:name "classes"
                                        :query "tag:classes and not tag:delete"
                                        :count-query "tag:classes and tag:unread")))
#+END_SRC

* Elfeed
  Elfeed is an extensible web feed reader for Emacs, supporting both Atom and
  RSS. Elfeed was inspired by notmuch.

  info: http://nullprogram.com/blog/2013/09/04/
  tips&tricks: http://nullprogram.com/blog/2013/11/26/

  | g   | refresh view of the feed listing                     |
  | G   | fetch feed updates from the servers                  |
  | s   | update the search filter (see tags)                  |
  | RET | view selected entry in a buffer                      |
  | b   | open selected entries in your browser (`browse-url`) |
  | y   | copy selected entries URL to the clipboard           |
  | r   | mark selected entries as read                        |
  | u   | mark selected entries as unread                      |
  | +   | add a specific tag to selected entries               |
  | -   | remove a specific tag from selected entries          |

#+BEGIN_SRC emacs-lisp
;; Set a global binding to call elfeed
(global-set-key (kbd "C-x w") 'elfeed)

;; Using elfeed-org to manage the feeds instead of the default from elfeed.
;; Elfeed-org is more flexible and easy to use.
;; Load elfeed-org
(require 'elfeed-org)

;; Initialize elfeed-org
;; This hooks up elfeed-org to read the configuration when elfeed
;; is started with =M-x elfeed=
(elfeed-org)

;; Optionally specify a number of files containing elfeed
;; configuration. If not set then the location below is used.
;; Note: The customize interface is also supported.
(setq rmh-elfeed-org-files (list "~/.emacs.d/elfeed.org"))
#+END_SRC

* Programming
** Python
   For setting a correct Python environment, first install these Python programs
   from the shell through pip:
   > pip install elpy epc jedi rope ipython (and maybe virtualenv)

