emacs.d/emacs-init.el

;; Setting Python path allowing elpy to find it
;(setenv "PYTHONPATH" "/usr/local/bin/python")

;; Enable elpy
(when (require 'elpy nil t)
  (elpy-enable))

(require 'jedi)
(add-hook 'python-mode-hook 'jedi:setup)
(setq jedi:complete-on-dot t)
(add-hook 'python-mode-hook 'jedi:ac-setup)

;(autoload 'jedi:setup "jedi" nil t)

;; Default keyboard shortcuts
(setq jedi:setup-keys t)

;; To complete on the “.” (when type some object or module name and a “.” it gives all the possible attributes/submodules/methods/etc)
(setq jedi:complete-on-dot t)

;; Setting Jedi as elpy backend
(setq elpy-rpc-backend "jedi")

;; Fixing a key binding bug in elpy
(define-key yas-minor-mode-map (kbd "C-c k") 'yas-expand)

;; Type:
;;     M-x package-install RET jedi RET
;;     M-x jedi:install-server RET
;; Then open Python file.

;(elpy-use-ipython)

;; Make Elpy work well with org-mode
;; check: https://github.com/jorgenschaefer/elpy/issues/191
;; https://github.com/jorgenschaefer/elpy/wiki/FAQ#q-how-do-i-make-elpy-work-well-with-org-mode
;; http://lists.gnu.org/archive/html/emacs-orgmode/2013-12/msg00063.html
;; https://lists.gnu.org/archive/html/emacs-orgmode/2015-01/msg00578.html

(setq org-babel-python-command "ipython --pylab=osx --pdb --nosep
                      --classic --no-banner --no-confirm-exit")

(defadvice org-babel-python-evaluate
    (around org-python-use-cpaste
            (session body &optional result-type result-params preamble) activate)
    "Add a %cpaste and '--' to the body, so that ipython does the right thing."
    (setq body (concat "%cpaste -q\n" body "\n--\n"))
    ad-do-it
    (if (stringp ad-return-value)
        (setq ad-return-value (replace-regexp-in-string "\\(^Pasting code; enter '--' alone on the line to stop or use Ctrl-D\.[\r\n]:*\\)" ""
                                                        ad-return-value))))

(setq python-shell-interpreter "ipython"
      python-shell-interpreter-args "--pylab=osx --pdb --nosep --classic --no-banner"
      python-shell-prompt-regexp ">>> "
      python-shell-prompt-output-regexp ""
      python-shell-completion-setup-code "from IPython.core.completerlib import module_completion"
      python-shell-completion-module-string-code "';'.join(module_completion('''%s'''))\n"
      python-shell-completion-string-code "';'.join(get_ipython().Completer.all_completions('''%s'''))\n"
      )

(setq ess-ask-for-ess-directory nil)
(setq inferior-R-program-name "/usr/local/bin/R")
(setq ess-local-process-name "R")
(setq ansi-color-for-comint-mode 'filter)
(setq comint-scroll-to-bottom-on-input t)
(setq comint-scroll-to-bottom-on-output t)
(setq comint-move-point-for-output t)
(setq ess-eval-visibly nil)
(require 'ess-site)

(setq-default fill-column 80) ;; set 80 column display as default

(require 'saveplace)
(setq save-place-file (concat user-emacs-directory "saveplace.el"))
(setq-default save-place t)

(defun select-current-line ()
   "Selects the current line"
   (interactive)
   (end-of-line)
   (push-mark (line-beginning-position) nil t))

;   (key-chord-define-global ".l" 'select-current-line)

(defun line-above()
   "Pastes line above"
   (interactive)
   (move-beginning-of-line nil)
   (newline-and-indent)
   (forward-line -1)
   (indent-according-to-mode))

;   (key-chord-define-global ".a" 'line-above)

(defun cut-line-or-region()
   ""
   (interactive)
   (if (region-active-p)
       (kill-region (region-beginning) (region-end))
     (kill-region (line-beginning-position) (line-beginning-position 2))))

;   (key-chord-define-global ".x" 'cut-line-or-region)

(defun copy-line-or-region()
   ""
   (interactive)
   (if (region-active-p)
       (kill-ring-save (region-beginning) (region-end))
     (kill-ring-save (line-beginning-position) (line-beginning-position 2))))

;   (key-chord-define-global ".c" 'copy-line-or-region)

(defun duplicate-current-line-or-region (arg)
   "Duplicates the current line or region ARG times.
 If there's no region, the current line will be duplicated. However, if
 there's a region, all lines that region covers will be duplicated."
   (interactive "p")
   (let (beg end (origin (point)))
     (if (and mark-active (> (point) (mark)))
         (exchange-point-and-mark))
     (setq beg (line-beginning-position))
     (if mark-active
         (exchange-point-and-mark))
     (setq end (line-end-position))
     (let ((region (buffer-substring-no-properties beg end)))
       (dotimes (i arg)
         (goto-char end)
         (newline)
         (beginning-of-visual-line)
         (insert region)
         (setq end (point)))
       (goto-char (+ origin (* (length region) arg) arg)))))

;   (key-chord-define-global ".d" 'duplicate-current-line-or-region)
